avr-rust/avrd/packs/atmega/ATmega64HVE2.atdf
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK1" offset="0x6F" size="1">
          <bitfield caption="Timer/Counter n Input Capture Interrupt Enable" mask="0x08" name="ICIE1"/>
          <bitfield caption="Timer/Counter1 Output Compare B Interrupt Enable" mask="0x04" name="OCIE1B"/>
          <bitfield caption="Timer/Counter1 Output Compare A Interrupt Enable" mask="0x02" name="OCIE1A"/>
          <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x01" name="TOIE1"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR1" offset="0x36" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter 1 Input Capture Flag" mask="0x08" name="ICF1"/>
          <bitfield caption="Timer/Counter1 Output Compare Flag B" mask="0x04" name="OCF1B"/>
          <bitfield caption="Timer/Counter1 Output Compare Flag A" mask="0x02" name="OCF1A"/>
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
        </register>
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset" mask="0x01" name="PSRSYNC"/>
        </register>
      </register-group>
      <register-group caption="Timer/Counter, 16-bit" name="TC0">
        <register caption="Timer/Counter0 Control Register B" name="TCCR0B" offset="0x45" size="1">
          <bitfield caption="Clock Select0 bit 2" mask="0x04" name="CS02"/>
          <bitfield caption="Clock Select0 bit 1" mask="0x02" name="CS01"/>
          <bitfield caption="Clock Select0 bit 0" mask="0x01" name="CS00" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter 0 Control Register A" name="TCCR0A" offset="0x44" size="1">
          <bitfield caption="Timer/Counter Width" mask="0x80" name="TCW0"/>
          <bitfield caption="Input Capture Mode Enable" mask="0x40" name="ICEN0"/>
          <bitfield caption="Input Capture Noise Canceler" mask="0x20" name="ICNC0"/>
          <bitfield caption="Input Capture Edge Select" mask="0x10" name="ICES0"/>
          <bitfield caption="Input Capture Select" mask="0x08" name="ICS0"/>
          <bitfield caption="Waveform Generation Mode" mask="0x01" name="WGM00"/>
        </register>
        <register caption="Timer Counter 0  Bytes" name="TCNT0" offset="0x46" size="2" mask="0xFFFF"/>
        <register caption="Output Compare Register 0A" name="OCR0A" offset="0x48" size="1" mask="0xFF"/>
        <register caption="Output Compare Register B" name="OCR0B" offset="0x49" size="1" mask="0xFF"/>
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK0" offset="0x6E" size="1">
          <bitfield caption="Timer/Counter n Input Capture Interrupt Enable" mask="0x08" name="ICIE0"/>
          <bitfield caption="Timer/Counter0 Output Compare B Interrupt Enable" mask="0x04" name="OCIE0B"/>
          <bitfield caption="Timer/Counter0 Output Compare A Interrupt Enable" mask="0x02" name="OCIE0A"/>
          <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR0" offset="0x35" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter 0 Input Capture Flag" mask="0x08" name="ICF0"/>
          <bitfield caption="Timer/Counter0 Output Compare Flag B" mask="0x04" name="OCF0B"/>
          <bitfield caption="Timer/Counter0 Output Compare Flag A" mask="0x02" name="OCF0A"/>
          <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x01" name="TOV0"/>
        </register>
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset" mask="0x01" name="PSRSYNC"/>
        </register>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tx Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tx Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port B Data Register" name="PORTB" offset="0x25" size="1" mask="0xFF"/>
        <register caption="Port B Data Direction Register" name="DDRB" offset="0x24" size="1" mask="0xFF"/>
        <register caption="Port B Input Pins" name="PINB" offset="0x23" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="Port B Override" name="PBOV" offset="0xdc" size="1">
          <bitfield caption="Port B Override Change Enable" mask="0x80" name="PBOVCE"/>
          <bitfield caption="Port B Override Enable 3" mask="0x08" name="PBOE3"/>
          <bitfield caption="Port B Override Enable 0" mask="0x01" name="PBOE0"/>
        </register>
      </register-group>
      <register-group caption="I/O Port" name="PORTA">
        <register caption="Port A Data Register" name="PORTA" offset="0x22" size="1" mask="0x03"/>
        <register caption="Port A Data Direction Register" name="DDRA" offset="0x21" size="1" mask="0x03"/>
        <register caption="Port A Input Pins" name="PINA" offset="0x20" size="1" mask="0x03" ocd-rw="R"/>
      </register-group>
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control and Status Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read-While-Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
          <bitfield caption="Read-While-Write Section Read Enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Lock Bit Set" mask="0x08" name="LBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="ADC Synchronization Control and Status Register" name="ADSCSRA" offset="0xe0" size="1">
          <bitfield caption="Synchronization Busy" mask="0x04" name="SBSY"/>
          <bitfield caption="Synchronization Command" mask="0x03" name="SCMD" values="SYNCHRONIZATION_COMMAND"/>
        </register>
