avr-rust/avrd/packs/atmega/ATmega64HVE2.atdf
        <register caption="ADC Synchronization Control and Status Register" name="ADSCSRB" offset="0xe1" size="1">
          <bitfield caption="V-ADC Instantaneous Conversion Polarity Status" mask="0x40" name="VADICPS"/>
          <bitfield caption="VADAC Data Read Out Busy" mask="0x20" name="VADACRB"/>
          <bitfield caption="VADIC Data Read Out Busy" mask="0x10" name="VADICRB"/>
          <bitfield caption="C-ADC Instantaneous Conversion Polarity Status" mask="0x04" name="CADICPS"/>
          <bitfield caption="CADAC Data Read Out Busy" mask="0x02" name="CADACRB"/>
          <bitfield caption="CADIC Data Read Out Busy" mask="0x01" name="CADICRB"/>
        </register>
        <register caption="ADC Control Register A" name="ADCRA" offset="0xe2" size="1">
          <bitfield caption="ADC Polarity Select" mask="0x08" name="ADPSEL"/>
          <bitfield caption="C-ADC Chopper Mode Select" mask="0x06" name="ADCMS" values="C_ADC_CHOPPER_MODE_SELECT"/>
          <bitfield caption="Sampling Clock Select" mask="0x01" name="CKSEL" values="SAMPLING_CLOCK_SELECT"/>
        </register>
        <register caption="ADC Control Register B" name="ADCRB" offset="0xe3" size="1">
          <bitfield caption="Instantaneous Decimation Ratio Select" mask="0x18" name="ADIDES" values="INSTANTANEOUS_DECIMATION_RATIO_SELECT"/>
          <bitfield caption="Accumulated Decimation Ratio Select" mask="0x07" name="ADADES" values="ACCUMULATED_DECIMATION_RATIO_SELECT"/>
        </register>
        <register caption="ADC Control Register B" name="ADCRC" offset="0xe4" size="1">
          <bitfield caption="C-ADC Enable" mask="0x80" name="CADEN"/>
          <bitfield caption="C-ADC Regular Current Comparator Mode" mask="0x30" name="CADRCM" values="C_ADC_REGULAR_CURRENT_COMPARATOR_MODE"/>
          <bitfield caption="C-ADC Regular Current Count Threshold" mask="0x0F" name="CADRCT" values="MISC_4BIT_COUNT"/>
        </register>
        <register caption="ADC Control Register D" name="ADCRD" offset="0xe5" size="1">
          <bitfield caption="C-ADC Gain" mask="0x38" name="CADG" values="C_ADC_INPUT_GAIN"/>
          <bitfield caption="C-ADC Pin Diagnostics Mode" mask="0x06" name="CADPDM" values="C_ADC_PIN_DIAGNOSIS_MODE"/>
          <bitfield caption="C-ADC Diagnostics Channel Select" mask="0x01" name="CADDSEL"/>
        </register>
        <register caption="ADC Control Register E" name="ADCRE" offset="0xe6" size="1">
          <bitfield caption="V-ADC Enable" mask="0x80" name="VADEN"/>
          <bitfield caption="V-ADC Reference Select" mask="0x20" name="VADREFS" values="V_ADC_REFERENCE_SELECT"/>
          <bitfield caption="V-ADC Pin Diagnostics Mode" mask="0x18" name="VADPDM" values="V_ADC_PIN_DIAGNOSIS_MODE"/>
          <bitfield caption="V-ADC Channel Select" mask="0x07" name="VADMUX" values="V_ADC_CHANNEL_SELECT"/>
        </register>
        <register caption="ADC Interrupt Flag Register" name="ADIFR" offset="0xe7" size="1">
          <bitfield caption="V-ADC Accumulated Voltage Interrupt Flag" mask="0x20" name="VADACIF"/>
          <bitfield caption="V-DAC Instantaneous Voltage Interrupt Flag" mask="0x10" name="VADICIF"/>
          <bitfield caption="C-ADC Regulator Current Interrupt Flag" mask="0x04" name="CADRCIF"/>
          <bitfield caption="C-ADC Accumulated Current Interrupt Flag" mask="0x02" name="CADACIF"/>
          <bitfield caption="C-ADC Instantaneous Current Interrupt Flag" mask="0x01" name="CADICIF"/>
        </register>
        <register caption="ADC Interrupt Mask Register" name="ADIMR" offset="0xe8" size="1">
          <bitfield caption="V-ADC Accumulated Voltage Interrupt Enable" mask="0x20" name="VADACIE"/>
          <bitfield caption="V-DAC Instantaneous Voltage Interrupt Enable" mask="0x10" name="VADICIE"/>
          <bitfield caption="C-ADC Regulator Current Interrupt Enable" mask="0x04" name="CADRCIE"/>
          <bitfield caption="C-ADC Accumulated Current Interrupt Enable" mask="0x02" name="CADACIE"/>
          <bitfield caption="C-ADC Instantaneous Current Interrupt Enable" mask="0x01" name="CADICIE"/>
        </register>
        <register caption="CC-ADC Regulator Current Comparator Threshold Level" name="CADRCL" offset="0xe9" size="2" mask="0xFFFF"/>
        <register caption="V-ADC Instantaneous Conversion Result" name="VADIC" offset="0xf1" size="2" mask="0xFFFF"/>
        <register caption="V-ADC Accumulated Conversion Result" name="VADAC3" offset="0xf6" size="1" mask="0xFF"/>
        <register caption="V-ADC Accumulated Conversion Result" name="VADAC2" offset="0xf5" size="1" mask="0xFF"/>
        <register caption="V-ADC Accumulated Conversion Result" name="VADAC1" offset="0xf4" size="1" mask="0xFF"/>
        <register caption="V-ADC Accumulated Conversion Result" name="VADAC0" offset="0xf3" size="1" mask="0xFF"/>
        <register caption="C-ADC Instantaneous Conversion Result" name="CADIC" offset="0xeb" size="2" mask="0xFFFF"/>
        <register caption="C-ADC Accumulated Conversion Result" name="CADAC3" offset="0xf0" size="1" mask="0xFF"/>
        <register caption="C-ADC Accumulated Conversion Result" name="CADAC2" offset="0xef" size="1" mask="0xFF"/>
        <register caption="C-ADC Accumulated Conversion Result" name="CADAC1" offset="0xee" size="1" mask="0xFF"/>
        <register caption="C-ADC Accumulated Conversion Result" name="CADAC0" offset="0xed" size="1" mask="0xFF"/>
      </register-group>
      <value-group caption="" name="SYNCHRONIZATION_COMMAND">
        <value caption="Reserved" name="VAL_0x00" value="0x00"/>
        <value caption="Reset and Synchronize" name="VAL_0x01" value="0x01"/>
        <value caption="Synchronize on next Instantaneous Conversion" name="VAL_0x02" value="0x02"/>
        <value caption="Synchronize on next Accumulated Conversion" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="C_ADC_CHOPPER_MODE_SELECT">
        <value caption="Chopping Disabled" name="VAL_0x00" value="0x00"/>
        <value caption="Automatic Fast Chopping" name="VAL_0x01" value="0x01"/>
        <value caption="Automatic Slow Chopping" name="VAL_0x02" value="0x02"/>
        <value caption="Software Polarity Control" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="SAMPLING_CLOCK_SELECT">
        <value caption="PLL (512kHz output) as sampling clock" name="VAL_0x00" value="0x00"/>
        <value caption="Slow RC Oscillator as sampling clock" name="VAL_0x01" value="0x01"/>
      </value-group>
      <value-group caption="" name="INSTANTANEOUS_DECIMATION_RATIO_SELECT">
        <value caption="512" name="VAL_0x00" value="0x00"/>
        <value caption="256" name="VAL_0x01" value="0x01"/>
        <value caption="128" name="VAL_0x02" value="0x02"/>
        <value caption="64" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="ACCUMULATED_DECIMATION_RATIO_SELECT">
        <value caption="512" name="VAL_0x00" value="0x00"/>
        <value caption="256" name="VAL_0x01" value="0x01"/>
        <value caption="128" name="VAL_0x02" value="0x02"/>
        <value caption="64" name="VAL_0x03" value="0x03"/>
        <value caption="32" name="VAL_0x04" value="0x04"/>
        <value caption="16" name="VAL_0x05" value="0x05"/>
        <value caption="8" name="VAL_0x06" value="0x06"/>
        <value caption="4" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="C_ADC_REGULAR_CURRENT_COMPARATOR_MODE">
        <value caption="Comparator Disabled" name="VAL_0x00" value="0x00"/>
        <value caption="Comparator Enabled. Regular Current Counter counts up if Accumulated Current is above threshold and is reset if Accumulated Current is below threshold." name="VAL_0x01" value="0x01"/>
        <value caption="Comparator Enabled. Regular Current Counter counts up if Accumulated Current is above threshold and down if Accumulated Current is below threshold." name="VAL_0x02" value="0x02"/>
        <value caption="Reserved" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="MISC_4BIT_COUNT">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="3" name="VAL_0x02" value="0x02"/>
        <value caption="4" name="VAL_0x03" value="0x03"/>
        <value caption="5" name="VAL_0x04" value="0x04"/>
        <value caption="6" name="VAL_0x05" value="0x05"/>
        <value caption="7" name="VAL_0x06" value="0x06"/>
        <value caption="8" name="VAL_0x07" value="0x07"/>
        <value caption="9" name="VAL_0x08" value="0x08"/>
        <value caption="10" name="VAL_0x09" value="0x09"/>
        <value caption="11" name="VAL_0x0a" value="0x0a"/>
        <value caption="12" name="VAL_0x0b" value="0x0b"/>
        <value caption="13" name="VAL_0x0c" value="0x0c"/>
        <value caption="14" name="VAL_0x0d" value="0x0d"/>
        <value caption="15" name="VAL_0x0e" value="0x0e"/>
        <value caption="16" name="VAL_0x0f" value="0x0f"/>
      </value-group>
      <value-group caption="" name="C_ADC_INPUT_GAIN">
        <value caption="4x" name="VAL_0x00" value="0x00"/>
        <value caption="8x" name="VAL_0x01" value="0x01"/>
        <value caption="16x" name="VAL_0x02" value="0x02"/>
        <value caption="32x" name="VAL_0x03" value="0x03"/>
        <value caption="64x" name="VAL_0x04" value="0x04"/>
        <value caption="128x" name="VAL_0x05" value="0x05"/>
        <value caption="256x" name="VAL_0x06" value="0x06"/>
        <value caption="Reserved" name="VAL_0x07" value="0x07"/>
      </value-group>
