avr-rust/avrd/packs/atmega/ATmega64HVE2.atdf
      <value-group caption="" name="C_ADC_PIN_DIAGNOSIS_MODE">
        <value caption="No current source is enabled" name="VAL_0x00" value="0x00"/>
        <value caption="Current source on PI pin enabled" name="VAL_0x01" value="0x01"/>
        <value caption="Current source on NI pin enabled" name="VAL_0x02" value="0x02"/>
        <value caption="Current source on both PI/NI pins enabled" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="V_ADC_REFERENCE_SELECT">
        <value caption="VREF as reference" name="VAL_0x00" value="0x00"/>
        <value caption="AVDD/3 as reference (for diagnosis purpose)" name="VAL_0x01" value="0x01"/>
      </value-group>
      <value-group caption="" name="V_ADC_PIN_DIAGNOSIS_MODE">
        <value caption="No current source is enabled" name="VAL_0x00" value="0x00"/>
        <value caption="Current source on PV pin enabled" name="VAL_0x01" value="0x01"/>
        <value caption="Current source on NV pin enabled" name="VAL_0x02" value="0x02"/>
        <value caption="Current source on both PV/NV pins enabled" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="V_ADC_CHANNEL_SELECT">
        <value caption="PV - NV" name="VAL_0x00" value="0x00"/>
        <value caption="ADC0 - SGND" name="VAL_0x01" value="0x01"/>
        <value caption="ADC1 - SGND" name="VAL_0x02" value="0x02"/>
        <value caption="VTEMP - GND" name="VAL_0x03" value="0x03"/>
        <value caption="DIAGNOSIS - GND (VREF/TBD)" name="VAL_0x04" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Reserved" name="VAL_0x06" value="0x06"/>
        <value caption="Reserved" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Bandgap" name="BANDGAP">
      <register-group caption="Bandgap" name="BANDGAP">
        <register caption="Bandgap Control and Status Register A" name="BGCSRA" offset="0xd1" size="1">
          <bitfield caption="Band Gap Sample Configuration" mask="0x07" name="BGSC"/>
        </register>
        <register caption="Band Gap Calibration Register A" name="BGCRA" offset="0xd3" size="1">
          <bitfield caption="Band Gap Calibration Nominal" mask="0xFF" name="BGCN"/>
        </register>
        <register caption="Band Gap Calibration Register B" name="BGCRB" offset="0xd2" size="1">
          <bitfield caption="Band Gap Calibration Linear" mask="0xFF" name="BGCL"/>
        </register>
        <register caption="Band Gap Lock Register" name="BGLR" offset="0xd4" size="1">
          <bitfield caption="Band Gap Lock Enable" mask="0x02" name="BGPLE"/>
          <bitfield caption="Band Gap Lock" mask="0x01" name="BGPL"/>
        </register>
      </register-group>
    </module>
    <module caption="Local Interconnect Network" name="LINUART">
      <register-group caption="Local Interconnect Network" name="LINUART">
        <register caption="LIN Control Register" name="LINCR" offset="0xc0" size="1">
          <bitfield caption="Software Reset" mask="0x80" name="LSWRES"/>
          <bitfield caption="LIN Standard" mask="0x40" name="LIN13"/>
          <bitfield caption="LIN Configuration bits" mask="0x30" name="LCONF"/>
          <bitfield caption="LIN or UART Enable" mask="0x08" name="LENA"/>
          <bitfield caption="LIN Command and Mode bits" mask="0x07" name="LCMD"/>
        </register>
        <register caption="LIN Status and Interrupt Register" name="LINSIR" offset="0xc1" size="1">
          <bitfield caption="Identifier Status bits" mask="0xE0" name="LIDST"/>
          <bitfield caption="Busy Signal" mask="0x10" name="LBUSY"/>
          <bitfield caption="Error Interrupt" mask="0x08" name="LERR"/>
          <bitfield caption="Identifier Interrupt" mask="0x04" name="LIDOK"/>
          <bitfield caption="Transmit Performed Interrupt" mask="0x02" name="LTXOK"/>
          <bitfield caption="Receive Performed Interrupt" mask="0x01" name="LRXOK"/>
        </register>
        <register caption="LIN Enable Interrupt Register" name="LINENIR" offset="0xc2" size="1">
          <bitfield caption="Enable Error Interrupt" mask="0x08" name="LENERR"/>
          <bitfield caption="Enable Identifier Interrupt" mask="0x04" name="LENIDOK"/>
          <bitfield caption="Enable Transmit Performed Interrupt" mask="0x02" name="LENTXOK"/>
          <bitfield caption="Enable Receive Performed Interrupt" mask="0x01" name="LENRXOK"/>
        </register>
        <register caption="LIN Error Register" name="LINERR" offset="0xc3" size="1" ocd-rw="R">
          <bitfield caption="Abort Flag" mask="0x80" name="LABORT"/>
          <bitfield caption="Frame Time Out Error Flag" mask="0x40" name="LTOERR"/>
          <bitfield caption="Overrun Error Flag" mask="0x20" name="LOVERR"/>
          <bitfield caption="Framing Error Flag" mask="0x10" name="LFERR"/>
          <bitfield caption="Synchronization Error Flag" mask="0x08" name="LSERR"/>
          <bitfield caption="Parity Error Flag" mask="0x04" name="LPERR"/>
          <bitfield caption="Checksum Error Flag" mask="0x02" name="LCERR"/>
          <bitfield caption="Bit Error Flag" mask="0x01" name="LBERR"/>
        </register>
        <register caption="LIN Bit Timing Register" name="LINBTR" offset="0xc4" size="1">
          <bitfield caption="Disable Bit Timing Resynchronization" mask="0x80" name="LDISR"/>
          <bitfield caption="LIN Bit Timing bits" mask="0x3F" name="LBT"/>
        </register>
        <register caption="LIN Baud Rate Low Register" name="LINBRRL" offset="0xc5" size="1">
          <bitfield caption="" mask="0xFF" name="LDIV"/>
        </register>
        <register caption="LIN Baud Rate High Register" name="LINBRRH" offset="0xc6" size="1">
          <bitfield caption="" mask="0x0F" name="LDIV" lsb="8"/>
        </register>
        <register caption="LIN Data Length Register" name="LINDLR" offset="0xc7" size="1">
          <bitfield caption="LIN Transmit Data Length bits" mask="0xF0" name="LTXDL"/>
          <bitfield caption="LIN Receive Data Length bits" mask="0x0F" name="LRXDL"/>
        </register>
        <register caption="LIN Identifier Register" name="LINIDR" offset="0xc8" size="1">
          <bitfield caption="Parity bits" mask="0xC0" name="LP"/>
          <bitfield caption="Identifier bit 5 or Data Length bits" mask="0x3F" name="LID"/>
        </register>
        <register caption="LIN Data Buffer Selection Register" name="LINSEL" offset="0xc9" size="1">
          <bitfield caption="Auto Increment of Data Buffer Index (Active Low)" mask="0x08" name="LAINC"/>
          <bitfield caption="FIFO LIN Data Buffer Index bits" mask="0x07" name="LINDX"/>
        </register>
        <register caption="LIN Data Register" name="LINDAT" offset="0xcA" size="1" ocd-rw="">
          <bitfield caption="" mask="0xFF" name="LDATA"/>
        </register>
      </register-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
