avr-rust/avrd/packs/atmega/ATmega64HVE2.atdf
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="Clock Output Enable" mask="0x20" name="CKOE"/>
          <bitfield caption="Pull-up disable" mask="0x10" name="PUD"/>
          <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
          <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1" ocd-rw="R">
          <bitfield caption="OCD Reset Flag" mask="0x10" name="OCDRF"/>
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BODRF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Slow Oscillator Calibration Register A" name="SOSCCALA" offset="0x66" size="1" mask="0xFF"/>
        <register caption="Oscillator Calibration Register B" name="SOSCCALB" offset="0x67" size="1" mask="0xFF"/>
        <register caption="PLL Control and Status Register" name="PLLCSR" offset="0xd8" size="1">
          <bitfield caption="PLL Software Enable" mask="0x20" name="SWEN"/>
          <bitfield caption="PLL Lock" mask="0x10" name="LOCK"/>
          <bitfield caption="PLL Lock Change Interrupt Flag" mask="0x02" name="PLLCIF"/>
          <bitfield caption="PLL Lock Change Interrupt Enable" mask="0x01" name="PLLCIE"/>
        </register>
        <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
          <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
        <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x4B" size="1" mask="0xFF"/>
        <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1" mask="0xFF"/>
        <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1" mask="0xFF"/>
        <register caption="Digital Input Disable Register" name="DIDR0" offset="0x7E" size="1">
          <bitfield caption="When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled." mask="0x02" name="PA1DID"/>
          <bitfield caption="When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled." mask="0x01" name="PA0DID"/>
        </register>
        <register caption="Power Reduction Register 0" name="PRR0" offset="0x64" size="1">
          <bitfield caption="Power Reduction LIN UART Interface" mask="0x08" name="PRLIN"/>
          <bitfield caption="Power reduction SPI" mask="0x04" name="PRSPI"/>
          <bitfield caption="Power Reduction Timer/Counter1" mask="0x02" name="PRTIM1"/>
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x01" name="PRTIM0"/>
        </register>
        <register caption="Clock Prescale Register" name="CLKPR" offset="0x61" size="1" ocd-rw="R">
          <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
          <bitfield caption="Clock Prescaler Select Bits" mask="0x03" name="CLKPS"/>
        </register>
      </register-group>
      <value-group caption="" name="CPU_SLEEP_MODE_3BITS">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Power Save" name="PSAVE" value="0x03"/>
        <value caption="Reserved" name="VAL_0x04" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Standby" name="STDBY" value="0x06"/>
        <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
      </value-group>
      <parameters>
        <param name="CORE_VERSION" value="V2E"/>
      </parameters>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="External Interrupt Control Register" name="EICRA" offset="0x69" size="1">
          <bitfield caption="External Interrupt Sense Control 0 Bit 1" mask="0x02" name="ISC01"/>
          <bitfield caption="External Interrupt Sense Control 0 Bit 0" mask="0x01" name="ISC00" values="INTERRUPT_SENSE_CONTROL"/>
        </register>
        <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
          <bitfield caption="External Interrupt Request 0 Enable" mask="0x01" name="INT0"/>
        </register>
        <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
          <bitfield caption="External Interrupt Flag 0" mask="0x01" name="INTF0"/>
        </register>
        <register caption="Pin Change Interrupt Control Register" name="PCICR" offset="0x68" size="1">
          <bitfield caption="Pin Change Interrupt Enables" mask="0x03" name="PCIE"/>
        </register>
        <register caption="Pin Change Interrupt Flag Register" name="PCIFR" offset="0x3B" size="1" ocd-rw="R">
          <bitfield caption="Pin Change Interrupt Flags" mask="0x03" name="PCIF"/>
        </register>
        <register caption="Pin Change Enable Mask Register 1" name="PCMSK1" offset="0x6C" size="1" mask="0xFF"/>
        <register caption="Pin Change Enable Mask Register 0" name="PCMSK0" offset="0x6B" size="1" mask="0x03"/>
      </register-group>
      <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
        <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
        <value caption="Any Logical Change of INTX" name="VAL_0x01" value="0x01"/>
        <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
        <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
